tap "aws/tap"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask", "https://github.com/Homebrew/brew"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "lucagrulla/tap"
tap "noahgorstein/tap"
tap "remotemobprogramming/brew"
tap "teamookla/speedtest"
brew "arduino-cli"
brew "openssl@3"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "bottom"
brew "gettext"
brew "catimg"
brew "chafa"
brew "gnutls"
brew "colima"
brew "coreutils"
brew "deno"
brew "docker", link: false
brew "drill"
brew "dust"
brew "exa"
brew "fd"
brew "gcc"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "gnupg@2.2"
brew "go"
brew "gopass"
brew "gpatch"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "k6"
brew "less"
brew "neovim"
brew "opam"
brew "openjdk"
brew "openvpn"
brew "pngpaste"
brew "pnpm"
brew "redis"
brew "ripgrep"
brew "rover"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "terraform"
brew "tig"
brew "tmux"
brew "tokei"
brew "viu"
brew "wget"
brew "xh"
brew "yarn"
brew "zoxide"
brew "joshmedeski/sesh/sesh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lucagrulla/tap/cw"
brew "noahgorstein/tap/jqp"
brew "remotemobprogramming/brew/mob"
cask "1password"
cask "docker"
cask "figma"
cask "firefox"
cask "flycut"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "keycastr"
cask "obs"
cask "obsidian"
cask "postman"
cask "shottr"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
cask "zoom"
vscode "akamud.vscode-theme-onelight"
vscode "alexcvzz.vscode-sqlite"
vscode "arjun.swagger-viewer"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "cssho.vscode-svgviewer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "jaredly.reason-vscode"
vscode "jebbs.plantuml"
vscode "joaompinto.asciidoctor-vscode"
vscode "johnpapa.vscode-peacock"
vscode "karigari.chat"
vscode "mariusalchimavicius.json-to-ts"
vscode "meganrogge.template-string-converter"
vscode "mgmcdermott.vscode-language-babel"
vscode "mkxml.vscode-filesize"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "skyapps.fish-vscode"
vscode "sodatea.velocity"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tomphilbin.gruvbox-themes"
vscode "uloco.theme-bluloco-light"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
vscode "xyc.vscode-mdx-preview"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
