tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions", "https://github.com/Homebrew/brew"
tap "homebrew/services"
tap "lucagrulla/tap"
tap "nikitabobko/tap"
brew "arduino-cli"
brew "atuin"
brew "openssl@3"
brew "aws-sam-cli"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "bottom"
brew "gettext"
brew "catimg"
brew "coreutils"
brew "datamash"
brew "deno"
brew "drill"
brew "dust"
brew "eza"
brew "fd"
brew "gnutls"
brew "icu4c@76"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "gnupg@2.2"
brew "go"
brew "gopass"
brew "gpatch"
brew "hcloud"
brew "htop"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "k6"
brew "less"
brew "luarocks"
brew "mise"
brew "mkcert"
brew "neovim"
brew "nushell"
brew "opam"
brew "openvpn"
brew "pkgconf"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "python@3.11"
brew "ripgrep"
brew "sesh"
brew "shellcheck"
brew "six"
brew "starship"
brew "stow"
brew "stylua"
brew "terraform"
brew "tmux"
brew "tokei"
brew "unar"
brew "viu"
brew "wget"
brew "xh"
brew "yarn"
brew "yazi"
brew "zbar"
brew "zoxide"
brew "lucagrulla/tap/cw"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "bruno"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "keycastr"
cask "obs"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "signal"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
