tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "remotemobprogramming/brew"
brew "arduino-cli"
brew "awscli"
brew "awslogs"
brew "bat"
brew "bottom"
brew "gettext"
brew "catimg"
brew "deno"
brew "docker", link: false
brew "drill"
brew "dust"
brew "exa"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "gnupg@2.2"
brew "go"
brew "gopass"
brew "gpatch"
brew "htop"
brew "hyperfine"
brew "jenv"
brew "jq"
brew "less"
brew "neovim"
brew "opam"
brew "openjdk"
brew "openssl@3"
brew "openvpn"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "stylua"
brew "terraform"
brew "tig"
brew "tmux"
brew "tokei"
brew "wget"
brew "xh"
brew "yarn"
brew "aws/tap/aws-sam-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "remotemobprogramming/brew/mob"
cask "1password"
cask "docker"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "google-drive"
cask "insomnia"
cask "iterm2"
cask "obs"
cask "obsidian"
cask "postman"
cask "signal"
cask "slack"
cask "utm"
cask "visual-studio-code"
cask "zoom"
